class Field:
    """
    Базовий клас Field для зберігання значення поля, що може використовуватися для різних типів даних.
    """

    def __init__(self, value):
        """
        Ініціалізує поле зі значенням.
        
        Параметри:
        - value: Значення, яке зберігається в полі.
        """
        self.value = value

    def __str__(self):
        """
        Повертає рядкове представлення значення поля.
        
        Повертає:
        - str: Рядок, що представляє значення поля.
        """
        return str(self.value)
